#Напишите функцию modify_list(l),
#которая принимает на вход список целых чисел,
#удаляет из него все нечётные значения,
#а чётные нацело делит на два.

#Функция не должна ничего возвращать,
#требуется только изменение переданного списка, например:


def modify_list(l):
    for i in range(len(l) - 1, -1, -1):
        if l[i] % 2 != 0:
            del l[i]
    for i in range (len(l)):
        l[i] = int(l[i] / 2)
    return

# ниже приведены данные для примера, к коду задачи они отношения не имеют

lst = [1, 2, 3, 4, 5, 5, 6]
print(modify_list(lst))  # None
print(lst)               # [1, 2, 3]
modify_list(lst)
print(lst)               # [1]


lst = [10, 5, 8, 3]
modify_list(lst)
print(lst)               # [5, 4]
