'''Создаем список:
d[i] - номер i + 1 класса,
d[i][0] - кол-во учеников
d[i][1] - суммарный рост рост '''
d = [[0, 0] for i in range(11)]
with open('dataset_3380_5.txt', 'r') as inf: # открываем файл
    for line in inf:
        line = line.strip().split('\t') # переводим строку с список
        d[int(line[0]) - 1][0] += 1 # добавляем +1 к кол-ву учеников в классе
        d[int(line[0]) - 1][1] += int(line[2]) # добавляем +1 к кол-ву учеников в классе
for i in range(11): # выводим статистику на экран
    if d[i][1] == 0: # если данных по классу нет,
        print(i + 1, '-') # то выводим номер класса с прочерком
    else: # иначе номер класса и суммарный рост, поделенный на кол-во учеников
        print(i + 1, d[i][1] / d[i][0])    
